micropython/micropython/ports/espressif/boards/lilygo_ttgo_t8_esp32_s2_wroom/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2022 Fabian Affolter <fabian@affolter-engineering.ch>
//
// SPDX-License-Identifier: MIT

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "TTGO T8 ESP32-S2-WROOM"
#define MICROPY_HW_MCU_NAME         "ESP32S2"
